In [1]:
import pandas as pd
from sqlalchemy import create_engine
import psycopg2
from etl_pass import password
import numpy as np

In [2]:
#read csv files
csv_file = 'data/WordsByCharacter.csv'
word_char_df = pd.read_csv(csv_file)
word_char_df.head()

,Film,Chapter,Character,Race,Words
0,The Fellowship Of The Ring,01: Prologue,Bilbo,Hobbit,4
1,The Fellowship Of The Ring,01: Prologue,Elrond,Elf,5
2,The Fellowship Of The Ring,01: Prologue,Galadriel,Elf,460
3,The Fellowship Of The Ring,01: Prologue,Gollum,Gollum,20
4,The Fellowship Of The Ring,02: Concerning Hobbits,Bilbo,Hobbit,214

In [3]:
#renamed the columns to match the DBD tables.
word_char_df = word_char_df.rename(columns={"Film": "Name", "Chapter": "Chapter_Name"})
word_char_df

,Name,Chapter_Name,Character,Race,Words
0,The Fellowship Of The Ring,01: Prologue,Bilbo,Hobbit,4
1,The Fellowship Of The Ring,01: Prologue,Elrond,Elf,5
2,The Fellowship Of The Ring,01: Prologue,Galadriel,Elf,460
3,The Fellowship Of The Ring,01: Prologue,Gollum,Gollum,20
4,The Fellowship Of The Ring,02: Concerning Hobbits,Bilbo,Hobbit,214
...,...,...,...,...,...
726,The Return Of The King,76: The Grey Havens,Elrond,Elf,6
727,The Return Of The King,76: The Grey Havens,Frodo,Hobbit,132
728,The Return Of The King,76: The Grey Havens,Galadriel,Elf,17
729,The Return Of The King,76: The Grey Havens,Gandalf,Ainur,42
730,The Return Of The King,76: The Grey Havens,Sam,Hobbit,14

In [4]:
# split chapter column into two columns to clear all numbers so it can readly be used as a join id for our SQl tables.
# copy file so it will not keep splitting and use copy...don't uncommen next two lines, if you have to, then watch 'chapter number' column as it will change.
# if column change, clear all output and run once, then comment the two code lines bellow...

word_char_df['ChapterNumber'], word_char_df['Chapter_Name'] = word_char_df['Chapter_Name'].str.split(' ', 1).str
word_final_df = word_char_df.copy()
word_final_df.head()

C:\Users\leo_z\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:5: FutureWarning: Columnar iteration over characters will be deprecated in future releases.
  """

,Name,Chapter_Name,Character,Race,Words,ChapterNumber
0,The Fellowship Of The Ring,Prologue,Bilbo,Hobbit,4,01:
1,The Fellowship Of The Ring,Prologue,Elrond,Elf,5,01:
2,The Fellowship Of The Ring,Prologue,Galadriel,Elf,460,01:
3,The Fellowship Of The Ring,Prologue,Gollum,Gollum,20,01:
4,The Fellowship Of The Ring,Concerning Hobbits,Bilbo,Hobbit,214,02:

In [5]:
#read another CSV file.
csv_file = 'data/Movies.csv'
Movies_info_df = pd.read_csv(csv_file)
Movies_info_df.head()

,Name,RuntimeInMinutes,BudgetInMillions,BoxOfficeRevenueInMillions,AcademyAwardNominations,AcademyAwardWins,RottenTomatoesScore
0,The Lord of the Rings Series,558,281,2917.0,30,17,94.000000
1,The Fellowship of the Ring,178,93,871.5,13,4,91.000000
2,The Two Towers,179,94,926.0,6,2,96.000000
3,The Return of the King,201,94,1120.0,11,11,95.000000
4,The Hobbit Series,462,675,2932.0,7,1,66.333333

In [6]:
#use only certain Lord of the Ring series movies.
Movies_filtered_df = Movies_info_df.drop(Movies_info_df.index[[0,4,5,6,7]])
Movies_filtered_df

,Name,RuntimeInMinutes,BudgetInMillions,BoxOfficeRevenueInMillions,AcademyAwardNominations,AcademyAwardWins,RottenTomatoesScore
1,The Fellowship of the Ring,178,93,871.5,13,4,91.0
2,The Two Towers,179,94,926.0,6,2,96.0
3,The Return of the King,201,94,1120.0,11,11,95.0

In [7]:
#capitalized the first letter of every word in column Name to match previous formatting in other CSV file.
Movies_filtered_df['Name'] = Movies_filtered_df.Name.str.title()
Movies_filtered_df

,Name,RuntimeInMinutes,BudgetInMillions,BoxOfficeRevenueInMillions,AcademyAwardNominations,AcademyAwardWins,RottenTomatoesScore
1,The Fellowship Of The Ring,178,93,871.5,13,4,91.0
2,The Two Towers,179,94,926.0,6,2,96.0
3,The Return Of The King,201,94,1120.0,11,11,95.0

In [8]:
#Creating the engines to connect to Postgres.
engine = create_engine("postgresql://postgres:{password}@localhost:5432/ETL_ProjectDB".format(password=password))
conn = engine.connect()

# Table films populated.
Movies_filtered_df.to_sql(name='films', con=engine, if_exists='append', index=False)

In [9]:
#query of sql for table films so we can extract ID and use it in other tables as Film_ID.
film_df = pd.read_sql('select * from films', conn)
film_df

,ID,Name,RuntimeInMinutes,BudgetInMillions,BoxOfficeRevenueInMillions,AcademyAwardNominations,AcademyAwardWins,RottenTomatoesScore
0,1,The Fellowship Of The Ring,178,$93.00,$871.50,13,4,91
1,2,The Two Towers,179,$94.00,$926.00,6,2,96
2,3,The Return Of The King,201,$94.00,"$1,120.00",11,11,95

In [10]:
film_df.ID[1]

2

In [11]:
#Inserting empty column into df.  Populated with ID from Film tables.
word_final_df["Film_ID"]=""
word_final_df.head()

,Name,Chapter_Name,Character,Race,Words,ChapterNumber,Film_ID
0,The Fellowship Of The Ring,Prologue,Bilbo,Hobbit,4,01:,
1,The Fellowship Of The Ring,Prologue,Elrond,Elf,5,01:,
2,The Fellowship Of The Ring,Prologue,Galadriel,Elf,460,01:,
3,The Fellowship Of The Ring,Prologue,Gollum,Gollum,20,01:,
4,The Fellowship Of The Ring,Concerning Hobbits,Bilbo,Hobbit,214,02:,

In [12]:
#iterated the data frame rows to populate the column Film_ID.
for index, row in word_final_df.iterrows(): 
    if row["Name"] == "The Fellowship Of The Ring":
        word_final_df.loc[index, "Film_ID"] = film_df.ID[0]
    elif row["Name"]== "The Two Towers":
        word_final_df.loc[index, "Film_ID"] = film_df.ID[1]
    else:
        word_final_df.loc[index, "Film_ID"] = film_df.ID[2]
        
word_final_df.head()

,Name,Chapter_Name,Character,Race,Words,ChapterNumber,Film_ID
0,The Fellowship Of The Ring,Prologue,Bilbo,Hobbit,4,01:,1
1,The Fellowship Of The Ring,Prologue,Elrond,Elf,5,01:,1
2,The Fellowship Of The Ring,Prologue,Galadriel,Elf,460,01:,1
3,The Fellowship Of The Ring,Prologue,Gollum,Gollum,20,01:,1
4,The Fellowship Of The Ring,Concerning Hobbits,Bilbo,Hobbit,214,02:,1

In [13]:
#created df to populate the table film_chapters.
film_chapter_df = word_final_df[["Film_ID", "Chapter_Name"]]
film_chapter_df.tail()

    Film_ID     Chapter_Name
726       3  The Grey Havens
727       3  The Grey Havens
728       3  The Grey Havens
729       3  The Grey Havens
730       3  The Grey Havens

In [14]:
#created df to populate the table characters.
characters_df = word_final_df[["Film_ID", "Character", "Race"]]
characters_df.head()

  Film_ID  Character    Race
0       1      Bilbo  Hobbit
1       1     Elrond     Elf
2       1  Galadriel     Elf
3       1     Gollum  Gollum
4       1      Bilbo  Hobbit

In [15]:
#imported module to deal with int64 error, Postgres does not read int64 Python object.
from psycopg2.extensions import register_adapter, AsIs
psycopg2.extensions.register_adapter(np.int64, psycopg2._psycopg.AsIs)

In [17]:
#populated the characters table in Postgres.
characters_df.to_sql(name='characters', con=engine, if_exists='append', index=False)

#populated the film_chapters table in Postgres.
film_chapter_df.to_sql(name='film_chapters', con=engine, if_exists='append', index=False)

In [18]:
#query the table of characters from Postgres to extract ID and use it in dialogues table df. 
characters_table_df = pd.read_sql('select * from characters', conn)
characters_table_df

      ID  Film_ID  Character    Race
0      1        1      Bilbo  Hobbit
1      2        1     Elrond     Elf
2      3        1  Galadriel     Elf
3      4        1     Gollum  Gollum
4      5        1      Bilbo  Hobbit
..   ...      ...        ...     ...
726  727        3     Elrond     Elf
727  728        3      Frodo  Hobbit
728  729        3  Galadriel     Elf
729  730        3    Gandalf   Ainur
730  731        3        Sam  Hobbit

[731 rows x 4 columns]

In [19]:
#query the table of film_chapters from Postgres to extract ID and use it in dialogues table df. 
film_chapters_table_df = pd.read_sql('select * from film_chapters', conn)
film_chapters_table_df.head()

   ID  Film_ID        Chapter_Name
0   1        1            Prologue
1   2        1            Prologue
2   3        1            Prologue
3   4        1            Prologue
4   5        1  Concerning Hobbits

In [21]:
#created the df for dialogues table.
dialogues_df = word_final_df[['Words']]
dialogues_df['Character_ID'] = characters_table_df['ID']
dialogues_df['Film_Chapter_ID'] = film_chapters_table_df['ID']
dialogues_df

C:\Users\leo_z\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\leo_z\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

     Words  Character_ID  Film_Chapter_ID
0        4             1                1
1        5             2                2
2      460             3                3
3       20             4                4
4      214             5                5
..     ...           ...              ...
726      6           727              727
727    132           728              728
728     17           729              729
729     42           730              730
730     14           731              731

[731 rows x 3 columns]

In [22]:
#populated dialogues table in Postgres. 
dialogues_df.to_sql(name='dialogues', con=engine, if_exists='append', index=False)

In [23]:
#query table to make sure it populated
dialogues_table_df = pd.read_sql('select * from dialogues', conn)
dialogues_table_df.head()

   ID  Character_ID  Film_Chapter_ID  Words
0   1             1                1      4
1   2             2                2      5
2   3             3                3    460
3   4             4                4     20
4   5             5                5    214